#### ExternallyTaggedGeometryValidation Members

---

|  |
| --- |
| ExternallyTaggedGeometryValidation Class   Methods   See Also |

The  ExternallyTaggedGeometryValidation  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | IsNonSolid | Makes sure that the input geometry object is not a Solid. |
| Public method Static member | IsSolid | Makes sure that the input geometry object is a Solid. |
| Public method Static member | IsValidGeometry | Validates the input geometry to be stored in an externally tagged geometry object. Valid types of geometry are: Solid, Mesh, GeometryInstance, Point and Curve. |

# See Also

ExternallyTaggedGeometryValidation Class

Autodesk.Revit.DB Namespace